//Ввод элементов массива

// 1) Считать int число
// int <- string
// 2. Создать массив
// 1) int чисел 
// int[] <- int 
// 3. Заполнить массив с клавиатуры
// int[] <- (void)
// Найти произведение пар
// int[] <- int[]
// Распечатать в новый массив
// string <- int[]


//Ввод элементов массива
// Заполнить массив с клавиатуры
Console.Clear();
Console.WriteLine("Введите элементы через пробел: ");

// Создание массива
int[] arr = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);





//int NumberfromUser(string numb);
//{
//Console.Write(numb + " ");
//return Convert.ToInt32(Console.ReadLine());
//}
//int size = NumberfromUser("Введите длину массива N: ");

// Ввод массива с клавиатуры (работа с целыми числами)

//int[] array = new int[size];

//void FillArray(int[] collection);
//{
    //int index = 0;
    //for (int i = 0; i < collection.Length; i ++)
    //{
        //Console.WriteLine("Введите элемент массива {0}: ", i + 1);
        //int num = Int32.Parse(Console.ReadLine());
        //collection[index++] = num;
    //}
//}
//Console.WriteLine(String.Join(' ', arr));

//int arr = Convert.ToInt32(Console.ReadLine());
///string str = Convert.ToString(arr);
//string[] temp = arr.Split(' ');



//char [] ar = str.ToCharArray();

//char [] ar = str.ToArray<char>();
//int[] Firstarray = new int[100];
            //int i=0;

//for int[]Firstarray <= N
//int[] Firstarray = Console.ReadLine().Split().Select(int.Parse).ToArray();
//string[] str = Console.ReadLine().Split();







//for(i <= N/2)

//number = a[i] * a[N - 1 - i]

//res[N/2]
//res[i] = a[i] * a[N - 1 - i];

