// 1. Считать данные пользователя (работа с целыми числами)
// 1) Считать int число
// int <- string
// 2. Создать массив
// 1) int чисел 
// int[] <- int 
// 3. Заполнить массив с клавиатуры
// int[] <- (void)
// Найти произведение пар
// int[] <- int[]
// Распечатать в новый массив
// string <- int[]

Console.Clear();

Console.WriteLine("Введите N-е количество целых чисел массива через пробел ");
//int[] arr = new int[N];
//Console.WriteLine(String.Join(' ', arr));

int arr = Convert.ToInt32(Console.ReadLine());
string str = Convert.ToString(arr);

//char [] ar = str.ToCharArray();

//char [] ar = str.ToArray<char>();
//int[] Firstarray = new int[100];
            //int i=0;

//for int[]Firstarray <= N
//int[] Firstarray = Console.ReadLine().Split().Select(int.Parse).ToArray();
//string[] str = Console.ReadLine().Split();







//for(i <= N/2)

//number = a[i] * a[N - 1 - i]

//res[N/2]
//res[i] = a[i] * a[N - 1 - i];